## Plan Result (ithc-backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"
        name                              = "cft-aks00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/bar-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "bar-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/fees-register-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "fees-register-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/idam-user-dashboard" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "idam-user-dashboard" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/idam-web-admin" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "idam-web-admin" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/aac-manage-case-assignment" -> null
          - name                                = "aac-manage-case-assignment" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/aac-manage-case-assignment" -> null
          - probe_name                          = "aac-manage-case-assignment" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - name                                = "adoption-cos-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/adoption-cos-api" -> null
          - probe_name                          = "adoption-cos-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/am-org-role-mapping-service" -> null
          - name                                = "am-org-role-mapping-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/am-org-role-mapping-service" -> null
          - probe_name                          = "am-org-role-mapping-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/am-role-assignment-service" -> null
          - name                                = "am-role-assignment-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/am-role-assignment-service" -> null
          - probe_name                          = "am-role-assignment-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/bar-api" -> null
          - name                                = "bar-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/bar-api" -> null
          - probe_name                          = "bar-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/camunda-api" -> null
          - name                                = "camunda-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/camunda-api" -> null
          - probe_name                          = "camunda-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-admin-web" -> null
          - name                                = "ccd-admin-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-admin-web" -> null
          - probe_name                          = "ccd-admin-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-case-activity-api" -> null
          - name                                = "ccd-case-activity-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-case-activity-api" -> null
          - probe_name                          = "ccd-case-activity-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-case-document-am-api" -> null
          - name                                = "ccd-case-document-am-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-case-document-am-api" -> null
          - probe_name                          = "ccd-case-document-am-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-data-store-api" -> null
          - name                                = "ccd-data-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-data-store-api" -> null
          - probe_name                          = "ccd-data-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-definition-store-api" -> null
          - name                                = "ccd-definition-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-definition-store-api" -> null
          - probe_name                          = "ccd-definition-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-message-publisher" -> null
          - name                                = "ccd-message-publisher" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-message-publisher" -> null
          - probe_name                          = "ccd-message-publisher" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccd-user-profile-api" -> null
          - name                                = "ccd-user-profile-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccd-user-profile-api" -> null
          - probe_name                          = "ccd-user-profile-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccpay-bulkscanning-api" -> null
          - name                                = "ccpay-bulkscanning-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccpay-bulkscanning-api" -> null
          - probe_name                          = "ccpay-bulkscanning-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendHttpSettingsCollection/ccpay-notifications-service" -> null
          - name                                = "ccpay-notifications-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/probes/ccpay-notifications-service" -> null
          - probe_name                          = "ccpay-notifications-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ith

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

Groups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-cft-hearing-service"
          + backend_address_pool_name  = "hmc-cft-hearing-service"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/hmc-cft-hearing-service"
          + backend_http_settings_name = "hmc-cft-hearing-service"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/hmc-cft-hearing-service"
          + http_listener_name         = "hmc-cft-hearing-service"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/hmc-cft-hearing-service"
          + name                       = "hmc-cft-hearing-service"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-hmi-inbound-adapter"
          + backend_address_pool_name  = "hmc-hmi-inbound-adapter"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/hmc-hmi-inbound-adapter"
          + backend_http_settings_name = "hmc-hmi-inbound-adapter"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/hmc-hmi-inbound-adapter"
          + http_listener_name         = "hmc-hmi-inbound-adapter"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/hmc-hmi-inbound-adapter"
          + name                       = "hmc-hmi-inbound-adapter"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-hmi-outbound-adapter"
          + backend_address_pool_name  = "hmc-hmi-outbound-adapter"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/hmc-hmi-outbound-adapter"
          + backend_http_settings_name = "hmc-hmi-outbound-adapter"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/hmc-hmi-outbound-adapter"
          + http_listener_name         = "hmc-hmi-outbound-adapter"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/hmc-hmi-outbound-adapter"
          + name                       = "hmc-hmi-outbound-adapter"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/idam-testing-support-api"
          + backend_address_pool_name  = "idam-testing-support-api"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/idam-testing-support-api"
          + backend_http_settings_name = "idam-testing-support-api"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/idam-testing-support-api"
          + http_listener_name         = "idam-testing-support-api"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/idam-testing-support-api"
          + name                       = "idam-testing-support-api"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "alertmanager-0"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "alertmanager-0"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "alertmanager-0"
          + id                         = (known after apply)
          + name                       = "alertmanager-0"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "alertmanager-1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "alertmanager-1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "alertmanager-1"
          + id                         = (known after apply)
          + name                       = "alertmanager-1"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = (known after apply)
          + name                       = "am-judicial-booking-service"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "civil-general-applications"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "civil-general-applications"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "civil-general-applications"
          + id                         = (known after apply)
          + name                       = "civil-general-applications"
          + priority                   = 150
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-cos"
          + id                         = (known after apply)
          + name                       = "et-cos"
          + priority                   = 110
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-hearings-api"
          + id                         = (known after apply)
          + name                       = "et-hearings-api"
          + priority                   = 140
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-msg-handler"
          + id                         = (known after apply)
          + name                       = "et-msg-handler"
          + priority                   = 120
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya-api"
          + id                         = (known after apply)
          + name                       = "et-sya-api"
          + priority                   = 130
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prometheus-0"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prometheus-0"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prometheus-0"
          + id                         = (known after apply)
          + name                       = "prometheus-0"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prometheus-1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prometheus-1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prometheus-1"
          + id                         = (known after apply)
          + name                       = "prometheus-1"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-case-api"
          + id                         = (known after apply)
          + name                       = "sptribs-case-api"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "traefik-cft-00"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "traefik-cft-00"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "traefik-cft-00"
          + id                         = (known after apply)
          + name                       = "traefik-cft-00"
          + priority                   = 170
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "traefik-cft-01"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "traefik-cft-01"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "traefik-cft-01"
          + id                         = (known after apply)
          + name                       = "traefik-cft-01"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (26 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1577,"Program":"tfcmt","SHA1":"","Target":"ithc-backendappgateway","Vars":{}} -->